http_cats/app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats"
---
    def index #all records in the table AKA ActiveRecord#all
        @cats = Cat.all

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show #individual record from table based on id AKA ActiveRecord#find(:id)
        @cat = Cat.find(params[:id])

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["color", "white"], ["description", ""], ["updated_at", "2020-04-24 20:30:10.417815"], ["id", 6]]
---
    def update
        @cat = Cat.find(params[:id])

        if @cat.update(cat_params)

INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        @cat = Cat.new(cat_params)

        if @cat.save